'''储存全部剧情文本'''

SPECIAL={"000":["\n"+"="*13+"特殊节点"+"="*13+"\n",
                "这个节点在编剧的掌控之外，\n"
                "你可以随便做点什么。",
                "1、老老实实跟着剧情走，愉快地跟她聊天。\n"
                "2、瞒着编剧，偷偷约她出来并送他礼物。\n"
                "3、悄悄地瞄一眼她对你的好感度。\n"
                "4、默默地退出游戏。",
                {"entry":"choice"}],

         "001":["\n时间过得飞快。",
                "你迎来了下一个重要节点。",
                {"entry":None}],

         "002":["\n她答应了你的邀请，你们将在无人知晓的地方约会。",
                "但是，你得准备好礼物才行，你现在有以下礼物：",
                "1、鲜花\n"
                "2、编程笔记\n"
                "3、奶茶\n"
                "4、奇怪的石头\n"
                "5、精致的钢笔\n"
                "6、可爱玩偶\n"
                "7、夜宵外卖",
                {"entry":"gift"}],

         "003":["\n你这个偷窥狂。。。",
                "居然靠着游戏机制偷看了她的好感度。",
                {"entry":"affinity"}],

         "004":["\n好吧，游戏结束了。\n",
                {"entry":"quit"}]}

PROLOGUE={"p00":["\n========游戏开始：校园 if·恋========\n",
                 "在开学典礼上，拿下压倒性成绩第一的你被选为新生代表发言。",
                 "在全场上千人的注视下，你气质非凡，发言流畅，很快成为焦点人物。",
                 "消息迅速传开，关于『神秘新生代表』的讨论充斥着整个校园。",
                 "于是，在这个新的舞台上，你与三位不同的女生产生了交集……",
                 {"entry":None}],

          "p01":["\n"+"="*13+"序幕·场景一"+"="*13+"\n",
                 "广场上挤满了人。",
                 "这里是社团纳新的现场，是每年开学都会生成的影像。",
                 "老实说，你对社团并不感兴趣，只是风度翩翩地在人群中穿梭，显得格外显眼。",
                 "于是，有一位学姐注意到了你。",
                 {"text":"这位新生？要不要来试试？加入绘画社有很多福利哦！","a":"很感兴趣","b":"不感兴趣"},
                 {"entry":"s","ans":"a"}],

          "p02":["\n在纵目睽睽下，你扬长而去……",
                 {"entry":None}],

          "p03":["\n"+"="*13+"序幕·场景二"+"="*13+"\n",
                 "图书馆是正确的。",
                 "无论如何，扩展可供访问的脑内记录是成功的唯一秘诀。",
                 "然后，你注意到了小白，她似乎被一道题难住了。",
                 "在某种缘分的驱动下，小白同时注意到了你，并向你投来求助的目光。",
                 {"text":"呜呜……这题到底该怎么写呀？","a":"耐心帮助她","b":"随意敷衍她"},
                 {"entry":"x","ans":"a"}],

          "p04":["\n『菜！』你留下无情的吐槽，扬长而去……",
                 {"entry":None}],

          "p05":["\n"+"="*13+"序幕·场景三"+"="*13+"\n",
                 "咖啡厅似乎是个好地方。",
                 "你尝试在咖啡厅里写代码，远离那些无趣的纠缠。",
                 "然而，一位成熟知性的姐姐缓缓接近了你。",
                 "看来咖啡厅并不算宁静。",
                 {"text":"你的代码思路很有趣呢，能给我讲讲你的实现方法吗？","a":"为她讲解","b":"默不作声"},
                 {"entry":"j","ans":"a"}],

          "p06":["对于这种无趣的搭讪，你感到十分厌烦……",
                 {"entry":"stupid"}],
                 
          "pse":["\n蛤？？？？？？？？？",
                 "三个都不要？？？？？",
                 "滚！！！！！！！！！",
                 "死现充别玩Galgame！",
                 "\n"+"="*15+"结局零"+"="*15+"\n",
                 "恭喜你通关了本游戏，你已解锁隐藏结局Stupid Ending。",
                 "本游戏还有其他结局，所以你赶紧重开吧。。。\n"]}

SENPAI={"s02":["\n你随手挑起一只笔，在纸上几笔勾勒出惊艳的图案，引得周围阵阵惊呼。",
               "学姐目光一震，眼神变得格外认真。",
               "你和学姐的故事正式开始。",
               {"entry":"special"}],

        "s03":["\n"+"="*12+"学姐线·场景一"+"="*12+"\n",
               "你成功进入绘画社。",
               {"text":"加入社团后，不能三天打鱼两天晒网哦。","a":"放心吧，我会认真对待。","b":"社团只是玩玩而已吧？不要太严肃了。"},
               {"entry":"question","ans":"a"}],

        "s04":["\n"+"="*12+"学姐线·场景二"+"="*12+"\n",
               "你完成了第一次绘画任务。",
               {"text":"这幅画……构图还算不错，你是随便画的吗？","a":"嗯，我是随手画的，没想到能得到你的认可。","b":"不，我可是很认真的！因为你在看嘛。"},
               {"entry":"question","ans":"b"}],

        "s05":["\n"+"="*12+"学姐线·场景三"+"="*12+"\n",
               "某天，社团活动结束了。",
               {"text":"今天的社团活动结束了，你要不要和我一起收拾？","a":"当然可以，我来帮你。","b":"算了吧，我还有事要做。"},
               {"entry":"question","ans":"a"}],

        "s06":["\n"+"="*12+"学姐线·场景四"+"="*12+"\n",
               "你和学姐已经相处了很长一段时间。",
               "现在，你正在和学姐一起吃饭。",
               {"text":"我平时比较严格，你会不会觉得我很不好相处？","a":"嗯……确实有点难相处。","b":"严格才好啊，我喜欢有目标的人。"},
               {"entry":"question","ans":"b"}],

        "s07":["\n"+"="*12+"学姐线·场景五"+"="*12+"\n",
               "这是一个难忘的日子。",
               "学姐突然向你告白。",
               "你自然是毫不犹豫的接受了她的告白。",
               {"entry":"end"}],

        "sbe":["你已走完学姐剧情,成功进入结局。",
               "\n多年后，你和学姐一起升学考研",
               "你自信从容的向学姐求婚",
               "然而——",
               "因为你没有刷满学姐的好感度",
               "结果,学姐把你甩了……",
               "\n"+"="*15+"结局一"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁学姐线Bad Ending。",
               "下次就不要老老实实跟着剧情走了，多送送礼物吧。"],

        "sge":["\n你和学姐的故事将永远定格在这美好的一刻！",
               "\n"+"="*15+"结局二"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁学姐线Good Ending。",
               "你至少要走完整个剧情吧，不然怎么进真结局呢？"],

        "ste":["\n多年后，你和学姐一起升学考研",
               "结婚生子",
               "有情人终成眷属！",
               "\n"+"="*15+"结局三"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁学姐线True Ending。",
               "之后就试试其他路线，其他结局吧。"]}

XIAOBAI={"x04":["\n你一把抢过她手中的笔，随手写下那显而易见的答案，紧接着开始了讲解。",
               "小白一脸惊愕，随即缓过神来，开始聆听你的讲解。",
               "你和小白的故事正式开始。",
               {"entry":"special"}],

        "x05":["\n"+"="*12+"小白线·场景一"+"="*12+"\n",
               "你正式成为了小白的老师",
               "某天，小白来找你问问题",
               {"text": "Python 里的 for 循环，我总是写不对……", "a": "来，我教你一个小技巧！", "b": "这种简单的东西，你都不会？"},
               {"entry":"question","ans":"a"}],

        "x06":["\n"+"="*12+"小白线·场景二"+"="*12+"\n",
               "你和小白的某次图书馆约会。",
               {"text": "你看我借了好多书，会不会显得很傻？", "a": "不会啊，这说明你很爱学习，很可爱。", "b": "嗯……的确有点太贪心了。"},
               {"entry":"question","ans":"b"}],

        "x07":["\n"+"="*12+"小白线·场景三"+"="*12+"\n",
               "小白以可爱的神情想你发出邀请！",
               {"text": "要不要一起留在图书馆自习？我想有人陪。","a": "算了，我还是回宿舍打游戏吧。", "b": "好啊，我正好也要复习。"},
               {"entry":"question","ans":"b"}],

        "x08":["\n"+"="*12+"小白线·场景四"+"="*12+"\n",
               "你和小白已经相处了很长一段时间。",
               "现在，你正在和学姐一起吃饭。",
               {"text": "你会不会觉得我太依赖你了？", "a": "嗯……是有点吧。", "b": "依赖我也没关系，我喜欢这种感觉。"},
               {"entry":"question","ans":"b"}],

        "x09":["\n"+"="*12+"小白线·场景五"+"="*12+"\n",
               "这是一个难忘的日子。",
               "你从容自信的向小白告白",
               "她娇羞的点头，回应了你的告白",
               {"entry":"end"}],

        "xbe":["你已走完小白剧情,成功进入结局。",
               "\n再往后的日子里，你们一同进步",
               "最后顺其自然的结了婚",
               "然而——",
               "因为你不愿意刷小白的好感度",
               "小白感到很委屈，离家出走了……",
               "\n"+"="*15+"结局四"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁小白线Bad Ending。",
               "下次就不要老老实实跟着剧情走了，多送送礼物吧。"],

        "xge":["\n你和小白的故事将永远定格在这美好的一刻！",
               "\n"+"="*15+"结局五"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁小白线Good Ending。",
               "你至少要走完整个剧情吧，不然怎么进真结局呢？"],

        "xte":["\n小白对你心生依赖",
               "时不时就喜欢对你撒娇",
               "直到最后，你们过上了甜蜜的婚后生活。",
               "\n"+"="*15+"结局六"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁小白线True Ending。",
               "之后就试试其他路线，其他结局吧。"]}

JIEJIE={"j06":["\n你停下敲键盘的手指，开始和她聊起编程的话题",
               "她笑的很温柔。",
               "你和姐姐的故事正式开始。",
               {"entry":"special"}],

        "j07":["\n"+"="*12+"姐姐线·场景一"+"="*12+"\n",
               "往后，你常常前往咖啡厅",
               "在那里，你能遇到姐姐",
               {"text": "你也喜欢在咖啡店看书吗？", "a": "其实我只是随便找个地方坐。", "b": "是啊，这里很安静，很适合思考。"},
               {"entry":"question","ans":"b"}],

        "j08":["\n"+"="*12+"姐姐线·场景二"+"="*12+"\n",
               "你主动和她聊起了研究生的话题。",
               {"text": "研究生的生活，其实没有你想象的那么光鲜。", "a": "我能理解，压力一定很大吧。", "b": "那我还是不要考研了。"},
               {"entry":"question","ans":"a"}],

        "j09":["\n"+"="*12+"姐姐线·场景三"+"="*12+"\n",
               "姐姐和喜欢在看书之余和你聊这样的话题",
               {"text": "你觉得，什么样的人最值得依靠？", "a": "稳重冷静的人。", "b": "长得好看的人。"},
               {"entry":"question","ans":"a"}],

        "j10":["\n"+"="*12+"姐姐线·场景四"+"="*12+"\n",
               "你和姐姐已经相处了很长一段时间。",
               "姐姐忽然找你倾诉。",
               {"text": "我常常一个人坐到很晚，你不会觉得孤单吗？", "a": "一个人太寂寞了，我受不了。", "b": "有时候孤单是种享受。"},
               {"entry":"question","ans":"b"}],

        "j11":["\n"+"="*12+"姐姐线·场景五"+"="*12+"\n",
               "这是一个难忘的日子。",
               "你和姐姐一直聊到了深夜",
               "在这种氛围下，你决定向她告白",
               "她似乎很惊讶，但还是接受了你的告白",
               {"entry":"end"}],

        "jbe":["你已走完姐姐剧情,成功进入结局。",
               "\n多年后，你和姐姐步入了婚姻",
               "你满心欢喜",
               "然而——",
               "因为你没有刷满姐姐的好感度",
               "她其实已经出轨了……",
               "\n"+"="*15+"结局一"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁姐姐线Bad Ending。",
               "下次就不要老老实实跟着剧情走了，多送送礼物吧。"],

        "jge":["\n你和姐姐的故事将永远定格在这美好的一刻！",
               "\n"+"="*15+"结局二"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁姐姐线Good Ending。",
               "你至少要走完整个剧情吧，不然怎么进真结局呢？"],

        "jte":["\n你和姐姐一起携手走向了未来",
               "她总是在生活中方方面面照顾你",
               "你们之间的感情令人羡慕",
               "\n"+"="*15+"结局三"+"="*15+"\n",
               "恭喜你通关了本游戏，你已解锁姐姐线True Ending。",
               "之后就试试其他路线，其他结局吧。"]}